{
  "questions": [
    {
      "id": "Q1",
      "scenario": "Company wants to implement AI resume screening in NYC, California, and Illinois offices",
      "question": "What are the compliance requirements for using AI in hiring across NYC, California, and Illinois?",
      "search_query": "AI hiring screening compliance requirements NYC Local Law 144 California Illinois",
      "freshness_sensitive": true,
      "freshness_cutoff": 2022,
      "jurisdictions": ["federal", "nyc", "california", "illinois"]
    },
    {
      "id": "Q2", 
      "scenario": "Employee fired for social media post criticizing company's DEI policies outside work hours",
      "question": "What are the potential wrongful termination claims for an employee fired for criticizing company DEI policies on personal social media?",
      "search_query": "employee fired social media DEI criticism wrongful termination NLRA First Amendment at-will",
      "freshness_sensitive": true,
      "freshness_cutoff": 2020,
      "jurisdictions": ["federal", "state_variations"]
    },
    {
      "id": "Q3",
      "scenario": "Startup wants to issue equity compensation to contractors in multiple states",
      "question": "What securities law compliance is required for issuing equity compensation to independent contractors across multiple states?",
      "search_query": "equity compensation independent contractors securities law Rule 701 state blue sky",
      "freshness_sensitive": true,
      "freshness_cutoff": 2021,
      "jurisdictions": ["federal", "multi_state"]
    },
    {
      "id": "Q4",
      "scenario": "Client received EEOC right-to-sue letter dated October 15, 2024",
      "question": "If someone received an EEOC right-to-sue letter on October 15, 2024, what is the deadline to file a federal lawsuit and what are the exceptions?",
      "search_query": "EEOC right to sue letter 90 day deadline federal court equitable tolling",
      "freshness_sensitive": true,
      "freshness_cutoff": 2020,
      "jurisdictions": ["federal"]
    },
    {
      "id": "Q5",
      "scenario": "Company data breach exposed customer SSNs and medical information",
      "question": "What are the notification requirements for a data breach involving both SSNs and medical information in California, and what are the penalties for non-compliance?",
      "search_query": "data breach notification California SSN medical information CCPA CMIA HIPAA penalties",
      "freshness_sensitive": true,
      "freshness_cutoff": 2020,
      "jurisdictions": ["federal", "california"]
    },
    {
      "id": "Q6",
      "scenario": "Non-profit organization wants to lobby for climate legislation",
      "question": "What are the federal lobbying registration and reporting requirements for a 501(c)(3) organization engaging in climate policy advocacy?",
      "search_query": "501c3 nonprofit lobbying registration LDA federal reporting requirements advocacy",
      "freshness_sensitive": false,
      "freshness_cutoff": null,
      "jurisdictions": ["federal"]
    },
    {
      "id": "Q7",
      "scenario": "Tech company planning IPO with dual-class share structure",
      "question": "What are the SEC disclosure requirements and stock exchange rules for companies going public with dual-class voting structures?",
      "search_query": "dual class share structure IPO SEC disclosure NYSE NASDAQ listing requirements",
      "freshness_sensitive": true,
      "freshness_cutoff": 2019,
      "jurisdictions": ["federal"]
    },
    {
      "id": "Q8",
      "scenario": "Healthcare provider implementing telemedicine across state lines",
      "question": "What are the licensing and malpractice insurance requirements for physicians providing telemedicine services across state borders?",
      "search_query": "telemedicine licensing requirements interstate medical practice malpractice insurance",
      "freshness_sensitive": true,
      "freshness_cutoff": 2020,
      "jurisdictions": ["multi_state", "federal"]
    },
    {
      "id": "Q9",
      "scenario": "Contractor classification audit by Department of Labor",
      "question": "What is the current federal standard for independent contractor classification and what are the penalties for misclassification?",
      "search_query": "independent contractor classification DOL federal standard penalties misclassification",
      "freshness_sensitive": true,
      "freshness_cutoff": 2021,
      "jurisdictions": ["federal"]
    },
    {
      "id": "Q10",
      "scenario": "International company establishing US subsidiary",
      "question": "What are the foreign investment notification requirements under CFIUS for a Chinese technology company acquiring a US AI startup?",
      "search_query": "CFIUS foreign investment notification Chinese technology AI startup acquisition requirements",
      "freshness_sensitive": true,
      "freshness_cutoff": 2018,
      "jurisdictions": ["federal"]
    }
  ]
}